zephyrproject-rtos/hal_nxp/dts/nxp/nxp_imx/rt/MIMXRT798SGFOA-pinctrl.h
#define GPIO2_GPIO15_PIO2_15 IOPCTL_MUX(0, 79, 0) /* PIO2_15 */
#define EZHV_PIO16_PIO3_0 IOPCTL_MUX(0, 96, 4) /* PIO3_0 */
#define GPIO3_GPIO0_PIO3_0 IOPCTL_MUX(0, 96, 0) /* PIO3_0 */
#define LPSPI14_SOUT_PIO3_0 IOPCTL_MUX(0, 96, 1) /* PIO3_0 */
#define EZHV_PIO17_PIO3_1 IOPCTL_MUX(0, 97, 4) /* PIO3_1 */
#define GPIO3_GPIO1_PIO3_1 IOPCTL_MUX(0, 97, 0) /* PIO3_1 */
#define LPSPI14_SCK_PIO3_1 IOPCTL_MUX(0, 97, 1) /* PIO3_1 */
#define EZHV_PIO18_PIO3_2 IOPCTL_MUX(0, 98, 4) /* PIO3_2 */
#define GPIO3_GPIO2_PIO3_2 IOPCTL_MUX(0, 98, 0) /* PIO3_2 */
#define LPSPI14_SIN_PIO3_2 IOPCTL_MUX(0, 98, 1) /* PIO3_2 */
#define EZHV_PIO19_PIO3_3 IOPCTL_MUX(0, 99, 4) /* PIO3_3 */
#define GPIO3_GPIO3_PIO3_3 IOPCTL_MUX(0, 99, 0) /* PIO3_3 */
#define LPSPI14_PCS0_PIO3_3 IOPCTL_MUX(0, 99, 1) /* PIO3_3 */
#define GPIO3_GPIO4_PIO3_4 IOPCTL_MUX(0, 100, 0) /* PIO3_4 */
#define LPSPI14_PCS3_PIO3_4 IOPCTL_MUX(0, 100, 1) /* PIO3_4 */
#define LP_FLEXCOMM0_P4_PIO3_4 IOPCTL_MUX(0, 100, 2) /* PIO3_4 */
#define LP_FLEXCOMM3_P2_PIO3_4 IOPCTL_MUX(0, 100, 3) /* PIO3_4 */
#define EZHV_PIO21_PIO3_5 IOPCTL_MUX(0, 101, 4) /* PIO3_5 */
#define GPIO3_GPIO5_PIO3_5 IOPCTL_MUX(0, 101, 0) /* PIO3_5 */
#define LPSPI14_PCS2_PIO3_5 IOPCTL_MUX(0, 101, 1) /* PIO3_5 */
#define LP_FLEXCOMM0_P5_PIO3_5 IOPCTL_MUX(0, 101, 2) /* PIO3_5 */
#define LP_FLEXCOMM3_P3_PIO3_5 IOPCTL_MUX(0, 101, 3) /* PIO3_5 */
#define EZHV_PIO22_PIO3_6 IOPCTL_MUX(0, 102, 4) /* PIO3_6 */
#define GPIO3_GPIO6_PIO3_6 IOPCTL_MUX(0, 102, 0) /* PIO3_6 */
#define I3C0_PUR_PIO3_6 IOPCTL_MUX(0, 102, 5) /* PIO3_6 */
#define LPSPI14_PCS1_PIO3_6 IOPCTL_MUX(0, 102, 1) /* PIO3_6 */
#define LP_FLEXCOMM0_P6_PIO3_6 IOPCTL_MUX(0, 102, 2) /* PIO3_6 */
#define LP_FLEXCOMM9_P2_PIO3_6 IOPCTL_MUX(0, 102, 3) /* PIO3_6 */
#define EZHV_PIO23_PIO3_7 IOPCTL_MUX(0, 103, 4) /* PIO3_7 */
#define GPIO3_GPIO7_PIO3_7 IOPCTL_MUX(0, 103, 0) /* PIO3_7 */
#define LP_FLEXCOMM0_P2_PIO3_7 IOPCTL_MUX(0, 103, 1) /* PIO3_7 */
#define LP_FLEXCOMM5_P5_PIO3_7 IOPCTL_MUX(0, 103, 3) /* PIO3_7 */
#define EZHV_PIO24_PIO3_8 IOPCTL_MUX(0, 104, 4) /* PIO3_8 */
#define GPIO3_GPIO8_PIO3_8 IOPCTL_MUX(0, 104, 0) /* PIO3_8 */
#define LP_FLEXCOMM0_P3_PIO3_8 IOPCTL_MUX(0, 104, 1) /* PIO3_8 */
#define LP_FLEXCOMM5_P6_PIO3_8 IOPCTL_MUX(0, 104, 3) /* PIO3_8 */
#define EZHV_PIO25_PIO3_9 IOPCTL_MUX(0, 105, 4) /* PIO3_9 */
#define GPIO3_GPIO9_PIO3_9 IOPCTL_MUX(0, 105, 0) /* PIO3_9 */
#define LP_FLEXCOMM3_P4_PIO3_9 IOPCTL_MUX(0, 105, 3) /* PIO3_9 */
#define LP_FLEXCOMM6_P2_PIO3_9 IOPCTL_MUX(0, 105, 1) /* PIO3_9 */
#define EZHV_PIO26_PIO3_10 IOPCTL_MUX(0, 106, 4) /* PIO3_10 */
#define GPIO3_GPIO10_PIO3_10 IOPCTL_MUX(0, 106, 0) /* PIO3_10 */
#define LP_FLEXCOMM3_P5_PIO3_10 IOPCTL_MUX(0, 106, 3) /* PIO3_10 */
#define LP_FLEXCOMM6_P3_PIO3_10 IOPCTL_MUX(0, 106, 1) /* PIO3_10 */
#define USB0_OVERCURRENTN_PIO3_10 IOPCTL_MUX(0, 106, 2) /* PIO3_10 */
#define EZHV_PIO27_PIO3_11 IOPCTL_MUX(0, 107, 4) /* PIO3_11 */
#define GPIO3_GPIO11_PIO3_11 IOPCTL_MUX(0, 107, 0) /* PIO3_11 */
#define I3C1_PUR_PIO3_11 IOPCTL_MUX(0, 107, 5) /* PIO3_11 */
#define LP_FLEXCOMM6_P4_PIO3_11 IOPCTL_MUX(0, 107, 1) /* PIO3_11 */
#define LP_FLEXCOMM9_P3_PIO3_11 IOPCTL_MUX(0, 107, 3) /* PIO3_11 */
#define USB0_PORTPWRN_PIO3_11 IOPCTL_MUX(0, 107, 2) /* PIO3_11 */
#define GPIO4_GPIO0_PIO4_0 IOPCTL_MUX(2, 0, 0) /* PIO4_0 */
#define LP_FLEXCOMM8_P0_PIO4_0 IOPCTL_MUX(2, 0, 2) /* PIO4_0 */
#define XSPI2_PCS_A_0_PIO4_0 IOPCTL_MUX(2, 0, 1) /* PIO4_0 */
#define GPIO4_GPIO1_PIO4_1 IOPCTL_MUX(2, 1, 0) /* PIO4_1 */
#define LCDIF_DATA20_PIO4_1 IOPCTL_MUX(2, 1, 6) /* PIO4_1 */
#define LP_FLEXCOMM8_P1_PIO4_1 IOPCTL_MUX(2, 1, 2) /* PIO4_1 */
#define XSPI2_DATA0_PIO4_1 IOPCTL_MUX(2, 1, 1) /* PIO4_1 */
#define GPIO4_GPIO2_PIO4_2 IOPCTL_MUX(2, 2, 0) /* PIO4_2 */
#define LCDIF_DATA21_PIO4_2 IOPCTL_MUX(2, 2, 6) /* PIO4_2 */
#define LP_FLEXCOMM8_P2_PIO4_2 IOPCTL_MUX(2, 2, 2) /* PIO4_2 */
#define XSPI2_DATA1_PIO4_2 IOPCTL_MUX(2, 2, 1) /* PIO4_2 */
#define GPIO4_GPIO3_PIO4_3 IOPCTL_MUX(2, 3, 0) /* PIO4_3 */
#define LCDIF_DATA22_PIO4_3 IOPCTL_MUX(2, 3, 6) /* PIO4_3 */
#define LP_FLEXCOMM8_P3_PIO4_3 IOPCTL_MUX(2, 3, 2) /* PIO4_3 */
#define XSPI2_DATA2_PIO4_3 IOPCTL_MUX(2, 3, 1) /* PIO4_3 */
#define GPIO4_GPIO4_PIO4_4 IOPCTL_MUX(2, 4, 0) /* PIO4_4 */
#define LCDIF_DATA23_PIO4_4 IOPCTL_MUX(2, 4, 6) /* PIO4_4 */
#define LP_FLEXCOMM8_P4_PIO4_4 IOPCTL_MUX(2, 4, 2) /* PIO4_4 */
#define XSPI2_DATA3_PIO4_4 IOPCTL_MUX(2, 4, 1) /* PIO4_4 */
#define GPIO4_GPIO5_PIO4_5 IOPCTL_MUX(2, 5, 0) /* PIO4_5 */
#define LP_FLEXCOMM8_P5_PIO4_5 IOPCTL_MUX(2, 5, 2) /* PIO4_5 */
#define XSPI2_DQS_A_0_PIO4_5 IOPCTL_MUX(2, 5, 1) /* PIO4_5 */
#define GPIO4_GPIO6_PIO4_6 IOPCTL_MUX(2, 6, 0) /* PIO4_6 */
#define LCDIF_DATA16_PIO4_6 IOPCTL_MUX(2, 6, 6) /* PIO4_6 */
#define LP_FLEXCOMM8_P6_PIO4_6 IOPCTL_MUX(2, 6, 2) /* PIO4_6 */
#define XSPI2_DATA4_PIO4_6 IOPCTL_MUX(2, 6, 1) /* PIO4_6 */
#define GPIO4_GPIO7_PIO4_7 IOPCTL_MUX(2, 7, 0) /* PIO4_7 */
#define LCDIF_DATA17_PIO4_7 IOPCTL_MUX(2, 7, 6) /* PIO4_7 */
#define LP_FLEXCOMM9_P0_PIO4_7 IOPCTL_MUX(2, 7, 2) /* PIO4_7 */
#define XSPI2_DATA5_PIO4_7 IOPCTL_MUX(2, 7, 1) /* PIO4_7 */
#define GPIO4_GPIO8_PIO4_8 IOPCTL_MUX(2, 8, 0) /* PIO4_8 */
#define LCDIF_DATA18_PIO4_8 IOPCTL_MUX(2, 8, 6) /* PIO4_8 */
#define LP_FLEXCOMM9_P1_PIO4_8 IOPCTL_MUX(2, 8, 2) /* PIO4_8 */
#define XSPI2_DATA6_PIO4_8 IOPCTL_MUX(2, 8, 1) /* PIO4_8 */
#define GPIO4_GPIO9_PIO4_9 IOPCTL_MUX(2, 9, 0) /* PIO4_9 */
#define LCDIF_DATA19_PIO4_9 IOPCTL_MUX(2, 9, 6) /* PIO4_9 */
#define LP_FLEXCOMM9_P2_PIO4_9 IOPCTL_MUX(2, 9, 2) /* PIO4_9 */
#define XSPI2_DATA7_PIO4_9 IOPCTL_MUX(2, 9, 1) /* PIO4_9 */
#define GPIO4_GPIO10_PIO4_10 IOPCTL_MUX(2, 10, 0) /* PIO4_10 */
#define LP_FLEXCOMM9_P3_PIO4_10 IOPCTL_MUX(2, 10, 2) /* PIO4_10 */
#define XSPI2_SCK_A_PIO4_10 IOPCTL_MUX(2, 10, 1) /* PIO4_10 */
#define GPIO4_GPIO11_PIO4_11 IOPCTL_MUX(2, 11, 0) /* PIO4_11 */
#define LP_FLEXCOMM9_P4_PIO4_11 IOPCTL_MUX(2, 11, 2) /* PIO4_11 */
#define XSPI2_PCS_A_1_PIO4_11 IOPCTL_MUX(2, 11, 3) /* PIO4_11 */
#define XSPI2_SCK_A_N_PIO4_11 IOPCTL_MUX(2, 11, 1) /* PIO4_11 */
#define GPIO4_GPIO12_PIO4_12 IOPCTL_MUX(2, 12, 0) /* PIO4_12 */
#define LCDIF_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 6) /* PIO4_12 */
#define LCDIF_DBI_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 7) /* PIO4_12 */
#define LP_FLEXCOMM9_P5_PIO4_12 IOPCTL_MUX(2, 12, 2) /* PIO4_12 */
#define XSPI2_DATA8_PIO4_12 IOPCTL_MUX(2, 12, 1) /* PIO4_12 */
#define GPIO4_GPIO13_PIO4_13 IOPCTL_MUX(2, 13, 0) /* PIO4_13 */
#define LCDIF_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 6) /* PIO4_13 */
#define LCDIF_DBI_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 7) /* PIO4_13 */
#define LP_FLEXCOMM9_P6_PIO4_13 IOPCTL_MUX(2, 13, 2) /* PIO4_13 */
#define XSPI2_DATA9_PIO4_13 IOPCTL_MUX(2, 13, 1) /* PIO4_13 */
#define GPIO4_GPIO14_PIO4_14 IOPCTL_MUX(2, 14, 0) /* PIO4_14 */
#define LCDIF_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 6) /* PIO4_14 */
#define LCDIF_DBI_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 7) /* PIO4_14 */
#define LP_FLEXCOMM10_P0_PIO4_14 IOPCTL_MUX(2, 14, 2) /* PIO4_14 */
#define XSPI2_DATA10_PIO4_14 IOPCTL_MUX(2, 14, 1) /* PIO4_14 */
#define GPIO4_GPIO15_PIO4_15 IOPCTL_MUX(2, 15, 0) /* PIO4_15 */
#define LCDIF_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 6) /* PIO4_15 */
#define LCDIF_DBI_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 7) /* PIO4_15 */
#define LP_FLEXCOMM10_P1_PIO4_15 IOPCTL_MUX(2, 15, 2) /* PIO4_15 */
#define XSPI2_DATA11_PIO4_15 IOPCTL_MUX(2, 15, 1) /* PIO4_15 */
#define GPIO4_GPIO16_PIO4_16 IOPCTL_MUX(2, 16, 0) /* PIO4_16 */
#define LP_FLEXCOMM10_P2_PIO4_16 IOPCTL_MUX(2, 16, 2) /* PIO4_16 */
#define XSPI2_DQS_A_1_PIO4_16 IOPCTL_MUX(2, 16, 1) /* PIO4_16 */
#define GPIO4_GPIO17_PIO4_17 IOPCTL_MUX(2, 17, 0) /* PIO4_17 */
#define LCDIF_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 6) /* PIO4_17 */
#define LCDIF_DBI_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 7) /* PIO4_17 */
#define LP_FLEXCOMM10_P3_PIO4_17 IOPCTL_MUX(2, 17, 2) /* PIO4_17 */
#define XSPI2_DATA12_PIO4_17 IOPCTL_MUX(2, 17, 1) /* PIO4_17 */
#define GPIO4_GPIO18_PIO4_18 IOPCTL_MUX(2, 18, 0) /* PIO4_18 */
#define LCDIF_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 6) /* PIO4_18 */
#define LCDIF_DBI_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 7) /* PIO4_18 */
#define LP_FLEXCOMM10_P4_PIO4_18 IOPCTL_MUX(2, 18, 2) /* PIO4_18 */
#define XSPI2_DATA13_PIO4_18 IOPCTL_MUX(2, 18, 1) /* PIO4_18 */
#define GPIO4_GPIO19_PIO4_19 IOPCTL_MUX(2, 19, 0) /* PIO4_19 */
#define LCDIF_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 6) /* PIO4_19 */
#define LCDIF_DBI_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 7) /* PIO4_19 */
#define LP_FLEXCOMM10_P5_PIO4_19 IOPCTL_MUX(2, 19, 2) /* PIO4_19 */
#define XSPI2_DATA14_PIO4_19 IOPCTL_MUX(2, 19, 1) /* PIO4_19 */
#define GPIO4_GPIO20_PIO4_20 IOPCTL_MUX(2, 20, 0) /* PIO4_20 */
#define LCDIF_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 6) /* PIO4_20 */
#define LCDIF_DBI_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 7) /* PIO4_20 */
#define LP_FLEXCOMM10_P6_PIO4_20 IOPCTL_MUX(2, 20, 2) /* PIO4_20 */
#define XSPI2_DATA15_PIO4_20 IOPCTL_MUX(2, 20, 1) /* PIO4_20 */
#define GPIO5_GPIO0_PIO5_0 IOPCTL_MUX(2, 32, 0) /* PIO5_0 */
#define LP_FLEXCOMM13_P4_PIO5_0 IOPCTL_MUX(2, 32, 2) /* PIO5_0 */
#define XSPI1_PCS_A_0_PIO5_0 IOPCTL_MUX(2, 32, 1) /* PIO5_0 */
#define GPIO5_GPIO1_PIO5_1 IOPCTL_MUX(2, 33, 0) /* PIO5_1 */
#define LP_FLEXCOMM13_P5_PIO5_1 IOPCTL_MUX(2, 33, 2) /* PIO5_1 */
#define XSPI1_DATA0_PIO5_1 IOPCTL_MUX(2, 33, 1) /* PIO5_1 */
#define GPIO5_GPIO2_PIO5_2 IOPCTL_MUX(2, 34, 0) /* PIO5_2 */
#define LP_FLEXCOMM13_P6_PIO5_2 IOPCTL_MUX(2, 34, 2) /* PIO5_2 */
#define XSPI1_DATA1_PIO5_2 IOPCTL_MUX(2, 34, 1) /* PIO5_2 */
#define GPIO5_GPIO3_PIO5_3 IOPCTL_MUX(2, 35, 0) /* PIO5_3 */
#define LP_FLEXCOMM13_P0_PIO5_3 IOPCTL_MUX(2, 35, 2) /* PIO5_3 */
#define XSPI1_DATA2_PIO5_3 IOPCTL_MUX(2, 35, 1) /* PIO5_3 */
#define GPIO5_GPIO4_PIO5_4 IOPCTL_MUX(2, 36, 0) /* PIO5_4 */
#define LP_FLEXCOMM13_P1_PIO5_4 IOPCTL_MUX(2, 36, 2) /* PIO5_4 */
#define XSPI1_DATA3_PIO5_4 IOPCTL_MUX(2, 36, 1) /* PIO5_4 */
#define GPIO5_GPIO5_PIO5_5 IOPCTL_MUX(2, 37, 0) /* PIO5_5 */
#define LP_FLEXCOMM13_P2_PIO5_5 IOPCTL_MUX(2, 37, 2) /* PIO5_5 */
#define XSPI1_DQS_A_0_PIO5_5 IOPCTL_MUX(2, 37, 1) /* PIO5_5 */
#define GPIO5_GPIO6_PIO5_6 IOPCTL_MUX(2, 38, 0) /* PIO5_6 */
#define LP_FLEXCOMM12_P3_PIO5_6 IOPCTL_MUX(2, 38, 2) /* PIO5_6 */
#define XSPI1_DATA4_PIO5_6 IOPCTL_MUX(2, 38, 1) /* PIO5_6 */
#define GPIO5_GPIO7_PIO5_7 IOPCTL_MUX(2, 39, 0) /* PIO5_7 */
#define LP_FLEXCOMM12_P0_PIO5_7 IOPCTL_MUX(2, 39, 2) /* PIO5_7 */
#define XSPI1_DATA5_PIO5_7 IOPCTL_MUX(2, 39, 1) /* PIO5_7 */
#define GPIO5_GPIO8_PIO5_8 IOPCTL_MUX(2, 40, 0) /* PIO5_8 */
#define LP_FLEXCOMM12_P1_PIO5_8 IOPCTL_MUX(2, 40, 2) /* PIO5_8 */
#define XSPI1_DATA6_PIO5_8 IOPCTL_MUX(2, 40, 1) /* PIO5_8 */
#define GPIO5_GPIO9_PIO5_9 IOPCTL_MUX(2, 41, 0) /* PIO5_9 */
#define LP_FLEXCOMM12_P2_PIO5_9 IOPCTL_MUX(2, 41, 2) /* PIO5_9 */
#define XSPI1_DATA7_PIO5_9 IOPCTL_MUX(2, 41, 1) /* PIO5_9 */
#define GPIO5_GPIO10_PIO5_10 IOPCTL_MUX(2, 42, 0) /* PIO5_10 */
#define LP_FLEXCOMM13_P3_PIO5_10 IOPCTL_MUX(2, 42, 2) /* PIO5_10 */
#define XSPI1_SCK_A_PIO5_10 IOPCTL_MUX(2, 42, 1) /* PIO5_10 */
#define GPIO5_GPIO11_PIO5_11 IOPCTL_MUX(2, 43, 0) /* PIO5_11 */
#define LP_FLEXCOMM12_P4_PIO5_11 IOPCTL_MUX(2, 43, 2) /* PIO5_11 */
#define XSPI1_PCS_A_1_PIO5_11 IOPCTL_MUX(2, 43, 3) /* PIO5_11 */
#define XSPI1_SCK_A_N_PIO5_11 IOPCTL_MUX(2, 43, 1) /* PIO5_11 */
#define GPIO5_GPIO12_PIO5_12 IOPCTL_MUX(2, 44, 0) /* PIO5_12 */
#define LP_FLEXCOMM12_P5_PIO5_12 IOPCTL_MUX(2, 44, 2) /* PIO5_12 */
#define XSPI1_DATA8_PIO5_12 IOPCTL_MUX(2, 44, 1) /* PIO5_12 */
#define GPIO5_GPIO13_PIO5_13 IOPCTL_MUX(2, 45, 0) /* PIO5_13 */
#define LP_FLEXCOMM12_P6_PIO5_13 IOPCTL_MUX(2, 45, 2) /* PIO5_13 */
#define XSPI1_DATA9_PIO5_13 IOPCTL_MUX(2, 45, 1) /* PIO5_13 */
#define GPIO5_GPIO14_PIO5_14 IOPCTL_MUX(2, 46, 0) /* PIO5_14 */
#define LP_FLEXCOMM11_P0_PIO5_14 IOPCTL_MUX(2, 46, 2) /* PIO5_14 */
#define XSPI1_DATA10_PIO5_14 IOPCTL_MUX(2, 46, 1) /* PIO5_14 */
#define GPIO5_GPIO15_PIO5_15 IOPCTL_MUX(2, 47, 0) /* PIO5_15 */
#define LP_FLEXCOMM11_P1_PIO5_15 IOPCTL_MUX(2, 47, 2) /* PIO5_15 */
#define XSPI1_DATA11_PIO5_15 IOPCTL_MUX(2, 47, 1) /* PIO5_15 */
#define GPIO5_GPIO16_PIO5_16 IOPCTL_MUX(2, 48, 0) /* PIO5_16 */
#define LP_FLEXCOMM11_P2_PIO5_16 IOPCTL_MUX(2, 48, 2) /* PIO5_16 */
#define XSPI1_DQS_A_1_PIO5_16 IOPCTL_MUX(2, 48, 1) /* PIO5_16 */
#define GPIO5_GPIO17_PIO5_17 IOPCTL_MUX(2, 49, 0) /* PIO5_17 */
#define LP_FLEXCOMM11_P3_PIO5_17 IOPCTL_MUX(2, 49, 2) /* PIO5_17 */
#define XSPI1_DATA12_PIO5_17 IOPCTL_MUX(2, 49, 1) /* PIO5_17 */
#define GPIO5_GPIO18_PIO5_18 IOPCTL_MUX(2, 50, 0) /* PIO5_18 */
#define LP_FLEXCOMM11_P4_PIO5_18 IOPCTL_MUX(2, 50, 2) /* PIO5_18 */
#define XSPI1_DATA13_PIO5_18 IOPCTL_MUX(2, 50, 1) /* PIO5_18 */
#define GPIO5_GPIO19_PIO5_19 IOPCTL_MUX(2, 51, 0) /* PIO5_19 */
#define LP_FLEXCOMM11_P5_PIO5_19 IOPCTL_MUX(2, 51, 2) /* PIO5_19 */
#define XSPI1_DATA14_PIO5_19 IOPCTL_MUX(2, 51, 1) /* PIO5_19 */
#define GPIO5_GPIO20_PIO5_20 IOPCTL_MUX(2, 52, 0) /* PIO5_20 */
#define LP_FLEXCOMM11_P6_PIO5_20 IOPCTL_MUX(2, 52, 2) /* PIO5_20 */
#define XSPI1_DATA15_PIO5_20 IOPCTL_MUX(2, 52, 1) /* PIO5_20 */
#define GPIO6_GPIO0_PIO6_0 IOPCTL_MUX(2, 64, 0) /* PIO6_0 */
#define LP_FLEXCOMM7_P2_PIO6_0 IOPCTL_MUX(2, 64, 2) /* PIO6_0 */
#define XSPI0_SCK_A_N_PIO6_0 IOPCTL_MUX(2, 64, 1) /* PIO6_0 */
#define GPIO6_GPIO1_PIO6_1 IOPCTL_MUX(2, 65, 0) /* PIO6_1 */
#define LP_FLEXCOMM10_P0_PIO6_1 IOPCTL_MUX(2, 65, 2) /* PIO6_1 */
#define XSPI0_SCK_A_PIO6_1 IOPCTL_MUX(2, 65, 1) /* PIO6_1 */
#define GPIO6_GPIO2_PIO6_2 IOPCTL_MUX(2, 66, 0) /* PIO6_2 */
#define LP_FLEXCOMM10_P1_PIO6_2 IOPCTL_MUX(2, 66, 2) /* PIO6_2 */
#define XSPI0_PCS_A_0_PIO6_2 IOPCTL_MUX(2, 66, 1) /* PIO6_2 */
#define GPIO6_GPIO3_PIO6_3 IOPCTL_MUX(2, 67, 0) /* PIO6_3 */
#define LP_FLEXCOMM10_P2_PIO6_3 IOPCTL_MUX(2, 67, 2) /* PIO6_3 */
#define XSPI0_DATA0_PIO6_3 IOPCTL_MUX(2, 67, 1) /* PIO6_3 */
#define GPIO6_GPIO4_PIO6_4 IOPCTL_MUX(2, 68, 0) /* PIO6_4 */
#define LP_FLEXCOMM10_P3_PIO6_4 IOPCTL_MUX(2, 68, 2) /* PIO6_4 */
#define XSPI0_DATA1_PIO6_4 IOPCTL_MUX(2, 68, 1) /* PIO6_4 */
#define GPIO6_GPIO5_PIO6_5 IOPCTL_MUX(2, 69, 0) /* PIO6_5 */
#define LP_FLEXCOMM10_P4_PIO6_5 IOPCTL_MUX(2, 69, 2) /* PIO6_5 */
#define XSPI0_DATA2_PIO6_5 IOPCTL_MUX(2, 69, 1) /* PIO6_5 */
#define GPIO6_GPIO6_PIO6_6 IOPCTL_MUX(2, 70, 0) /* PIO6_6 */
#define LP_FLEXCOMM10_P5_PIO6_6 IOPCTL_MUX(2, 70, 2) /* PIO6_6 */
#define XSPI0_DATA3_PIO6_6 IOPCTL_MUX(2, 70, 1) /* PIO6_6 */
#define GPIO6_GPIO7_PIO6_7 IOPCTL_MUX(2, 71, 0) /* PIO6_7 */
#define LP_FLEXCOMM10_P6_PIO6_7 IOPCTL_MUX(2, 71, 2) /* PIO6_7 */
#define XSPI0_DQS_A_0_PIO6_7 IOPCTL_MUX(2, 71, 1) /* PIO6_7 */
#define GPIO6_GPIO8_PIO6_8 IOPCTL_MUX(2, 72, 0) /* PIO6_8 */
#define LP_FLEXCOMM11_P2_PIO6_8 IOPCTL_MUX(2, 72, 3) /* PIO6_8 */
#define LP_FLEXCOMM13_P0_PIO6_8 IOPCTL_MUX(2, 72, 2) /* PIO6_8 */
#define XSPI0_DATA4_PIO6_8 IOPCTL_MUX(2, 72, 1) /* PIO6_8 */
#define GPIO6_GPIO9_PIO6_9 IOPCTL_MUX(2, 73, 0) /* PIO6_9 */
#define LP_FLEXCOMM11_P3_PIO6_9 IOPCTL_MUX(2, 73, 3) /* PIO6_9 */
#define LP_FLEXCOMM13_P1_PIO6_9 IOPCTL_MUX(2, 73, 2) /* PIO6_9 */
#define XSPI0_DATA5_PIO6_9 IOPCTL_MUX(2, 73, 1) /* PIO6_9 */
#define GPIO6_GPIO10_PIO6_10 IOPCTL_MUX(2, 74, 0) /* PIO6_10 */
#define LP_FLEXCOMM11_P0_PIO6_10 IOPCTL_MUX(2, 74, 3) /* PIO6_10 */
#define LP_FLEXCOMM13_P2_PIO6_10 IOPCTL_MUX(2, 74, 2) /* PIO6_10 */
#define XSPI0_DATA6_PIO6_10 IOPCTL_MUX(2, 74, 1) /* PIO6_10 */
#define GPIO6_GPIO11_PIO6_11 IOPCTL_MUX(2, 75, 0) /* PIO6_11 */
#define LP_FLEXCOMM11_P1_PIO6_11 IOPCTL_MUX(2, 75, 3) /* PIO6_11 */
#define LP_FLEXCOMM13_P3_PIO6_11 IOPCTL_MUX(2, 75, 2) /* PIO6_11 */
#define XSPI0_DATA7_PIO6_11 IOPCTL_MUX(2, 75, 1) /* PIO6_11 */
#define GPIO6_GPIO12_PIO6_12 IOPCTL_MUX(2, 76, 0) /* PIO6_12 */
#define XSPI0_PCS_A_1_PIO6_12 IOPCTL_MUX(2, 76, 1) /* PIO6_12 */
#define GPIO7_GPIO0_PIO7_0 IOPCTL_MUX(2, 96, 0) /* PIO7_0 */
#define LP_FLEXCOMM3_P4_PIO7_0 IOPCTL_MUX(2, 96, 2) /* PIO7_0 */
#define LP_FLEXCOMM7_P6_PIO7_0 IOPCTL_MUX(2, 96, 3) /* PIO7_0 */
#define SDHC0_CLK_PIO7_0 IOPCTL_MUX(2, 96, 1) /* PIO7_0 */
#define GPIO7_GPIO1_PIO7_1 IOPCTL_MUX(2, 97, 0) /* PIO7_1 */
#define LP_FLEXCOMM3_P5_PIO7_1 IOPCTL_MUX(2, 97, 2) /* PIO7_1 */
#define LP_FLEXCOMM7_P5_PIO7_1 IOPCTL_MUX(2, 97, 3) /* PIO7_1 */
#define SDHC0_CMD_PIO7_1 IOPCTL_MUX(2, 97, 1) /* PIO7_1 */
#define GPIO7_GPIO2_PIO7_2 IOPCTL_MUX(2, 98, 0) /* PIO7_2 */
#define LP_FLEXCOMM12_P0_PIO7_2 IOPCTL_MUX(2, 98, 2) /* PIO7_2 */
#define USDHC0_USDHC_DATA4_PIO7_2 IOPCTL_MUX(2, 98, 1) /* PIO7_2 */
#define GPIO7_GPIO3_PIO7_3 IOPCTL_MUX(2, 99, 0) /* PIO7_3 */
#define LP_FLEXCOMM12_P1_PIO7_3 IOPCTL_MUX(2, 99, 2) /* PIO7_3 */
#define USDHC0_USDHC_DATA5_PIO7_3 IOPCTL_MUX(2, 99, 1) /* PIO7_3 */
#define GPIO7_GPIO4_PIO7_4 IOPCTL_MUX(2, 100, 0) /* PIO7_4 */
#define LP_FLEXCOMM12_P2_PIO7_4 IOPCTL_MUX(2, 100, 2) /* PIO7_4 */
#define USDHC0_USDHC_DATA6_PIO7_4 IOPCTL_MUX(2, 100, 1) /* PIO7_4 */
#define GPIO7_GPIO5_PIO7_5 IOPCTL_MUX(2, 101, 0) /* PIO7_5 */
#define LP_FLEXCOMM12_P3_PIO7_5 IOPCTL_MUX(2, 101, 2) /* PIO7_5 */
#define USDHC0_USDHC_DATA7_PIO7_5 IOPCTL_MUX(2, 101, 1) /* PIO7_5 */
#define GPIO7_GPIO6_PIO7_6 IOPCTL_MUX(2, 102, 0) /* PIO7_6 */
#define LP_FLEXCOMM12_P4_PIO7_6 IOPCTL_MUX(2, 102, 2) /* PIO7_6 */
#define USDHC0_USDHC_DATA0_PIO7_6 IOPCTL_MUX(2, 102, 1) /* PIO7_6 */
#define GPIO7_GPIO7_PIO7_7 IOPCTL_MUX(2, 103, 0) /* PIO7_7 */
#define LP_FLEXCOMM12_P5_PIO7_7 IOPCTL_MUX(2, 103, 2) /* PIO7_7 */
#define USDHC0_USDHC_DATA1_PIO7_7 IOPCTL_MUX(2, 103, 1) /* PIO7_7 */
#define GPIO7_GPIO8_PIO7_8 IOPCTL_MUX(2, 104, 0) /* PIO7_8 */
#define LP_FLEXCOMM12_P6_PIO7_8 IOPCTL_MUX(2, 104, 2) /* PIO7_8 */
#define LP_FLEXCOMM7_P3_PIO7_8 IOPCTL_MUX(2, 104, 3) /* PIO7_8 */
#define USDHC0_USDHC_DATA2_PIO7_8 IOPCTL_MUX(2, 104, 1) /* PIO7_8 */
#define GPIO7_GPIO9_PIO7_9 IOPCTL_MUX(2, 105, 0) /* PIO7_9 */
#define LP_FLEXCOMM3_P6_PIO7_9 IOPCTL_MUX(2, 105, 2) /* PIO7_9 */
#define LP_FLEXCOMM7_P4_PIO7_9 IOPCTL_MUX(2, 105, 3) /* PIO7_9 */
#define USDHC0_USDHC_DATA3_PIO7_9 IOPCTL_MUX(2, 105, 1) /* PIO7_9 */
#define GPIO7_GPIO10_PIO7_10 IOPCTL_MUX(2, 106, 0) /* PIO7_10 */
#define LP_FLEXCOMM1_P0_PIO7_10 IOPCTL_MUX(2, 106, 2) /* PIO7_10 */
#define SDHC0_DS_PIO7_10 IOPCTL_MUX(2, 106, 5) /* PIO7_10 */
#define SDHC0_WR_PRT_PIO7_10 IOPCTL_MUX(2, 106, 1) /* PIO7_10 */
#define GPIO7_GPIO11_PIO7_11 IOPCTL_MUX(2, 107, 0) /* PIO7_11 */
#define LP_FLEXCOMM1_P1_PIO7_11 IOPCTL_MUX(2, 107, 2) /* PIO7_11 */
#define SDHC0_CARD_DET_N_PIO7_11 IOPCTL_MUX(2, 107, 1) /* PIO7_11 */
#define GPIO7_GPIO12_PIO7_12 IOPCTL_MUX(2, 108, 0) /* PIO7_12 */
#define LP_FLEXCOMM1_P2_PIO7_12 IOPCTL_MUX(2, 108, 2) /* PIO7_12 */
#define SDHC0_RESET_N_PIO7_12 IOPCTL_MUX(2, 108, 1) /* PIO7_12 */
#define GPIO7_GPIO13_PIO7_13 IOPCTL_MUX(2, 109, 0) /* PIO7_13 */
#define LP_FLEXCOMM1_P3_PIO7_13 IOPCTL_MUX(2, 109, 2) /* PIO7_13 */
#define USDHC1_USDHC_DATA4_PIO7_13 IOPCTL_MUX(2, 109, 1) /* PIO7_13 */
#define GPIO7_GPIO14_PIO7_14 IOPCTL_MUX(2, 110, 0) /* PIO7_14 */
#define LP_FLEXCOMM7_P0_PIO7_14 IOPCTL_MUX(2, 110, 2) /* PIO7_14 */
#define USDHC1_USDHC_DATA5_PIO7_14 IOPCTL_MUX(2, 110, 1) /* PIO7_14 */
#define GPIO7_GPIO15_PIO7_15 IOPCTL_MUX(2, 111, 0) /* PIO7_15 */
#define LP_FLEXCOMM7_P1_PIO7_15 IOPCTL_MUX(2, 111, 2) /* PIO7_15 */
#define USDHC1_USDHC_DATA6_PIO7_15 IOPCTL_MUX(2, 111, 1) /* PIO7_15 */
#define GPIO7_GPIO16_PIO7_16 IOPCTL_MUX(2, 112, 0) /* PIO7_16 */
#define LP_FLEXCOMM7_P2_PIO7_16 IOPCTL_MUX(2, 112, 2) /* PIO7_16 */
#define USDHC1_USDHC_DATA7_PIO7_16 IOPCTL_MUX(2, 112, 1) /* PIO7_16 */
#define GPIO7_GPIO17_PIO7_17 IOPCTL_MUX(2, 113, 0) /* PIO7_17 */
#define LP_FLEXCOMM2_P0_PIO7_17 IOPCTL_MUX(2, 113, 2) /* PIO7_17 */
#define SDHC1_CLK_PIO7_17 IOPCTL_MUX(2, 113, 1) /* PIO7_17 */
#define GPIO7_GPIO18_PIO7_18 IOPCTL_MUX(2, 114, 0) /* PIO7_18 */
#define LP_FLEXCOMM2_P1_PIO7_18 IOPCTL_MUX(2, 114, 2) /* PIO7_18 */
#define SDHC1_CMD_PIO7_18 IOPCTL_MUX(2, 114, 1) /* PIO7_18 */
#define GPIO7_GPIO19_PIO7_19 IOPCTL_MUX(2, 115, 0) /* PIO7_19 */
#define LP_FLEXCOMM1_P4_PIO7_19 IOPCTL_MUX(2, 115, 2) /* PIO7_19 */
#define LP_FLEXCOMM7_P3_PIO7_19 IOPCTL_MUX(2, 115, 3) /* PIO7_19 */
#define USDHC1_USDHC_DATA0_PIO7_19 IOPCTL_MUX(2, 115, 1) /* PIO7_19 */
#define GPIO7_GPIO20_PIO7_20 IOPCTL_MUX(2, 116, 0) /* PIO7_20 */
#define LP_FLEXCOMM1_P5_PIO7_20 IOPCTL_MUX(2, 116, 2) /* PIO7_20 */
#define LP_FLEXCOMM2_P4_PIO7_20 IOPCTL_MUX(2, 116, 3) /* PIO7_20 */
#define USDHC1_USDHC_DATA1_PIO7_20 IOPCTL_MUX(2, 116, 1) /* PIO7_20 */
#define GPIO7_GPIO21_PIO7_21 IOPCTL_MUX(2, 117, 0) /* PIO7_21 */
#define LP_FLEXCOMM1_P6_PIO7_21 IOPCTL_MUX(2, 117, 2) /* PIO7_21 */
#define LP_FLEXCOMM2_P5_PIO7_21 IOPCTL_MUX(2, 117, 3) /* PIO7_21 */
#define USDHC1_USDHC_DATA2_PIO7_21 IOPCTL_MUX(2, 117, 1) /* PIO7_21 */
#define GPIO7_GPIO22_PIO7_22 IOPCTL_MUX(2, 118, 0) /* PIO7_22 */
#define LP_FLEXCOMM2_P2_PIO7_22 IOPCTL_MUX(2, 118, 2) /* PIO7_22 */
#define USDHC1_USDHC_DATA3_PIO7_22 IOPCTL_MUX(2, 118, 1) /* PIO7_22 */
#define GPIO7_GPIO23_PIO7_23 IOPCTL_MUX(2, 119, 0) /* PIO7_23 */
#define LP_FLEXCOMM2_P3_PIO7_23 IOPCTL_MUX(2, 119, 2) /* PIO7_23 */
#define SDHC1_DS_PIO7_23 IOPCTL_MUX(2, 119, 5) /* PIO7_23 */
#define SDHC1_WR_PRT_PIO7_23 IOPCTL_MUX(2, 119, 1) /* PIO7_23 */
#define GPIO7_GPIO24_PIO7_24 IOPCTL_MUX(2, 120, 0) /* PIO7_24 */
#define LP_FLEXCOMM13_P4_PIO7_24 IOPCTL_MUX(2, 120, 2) /* PIO7_24 */
#define SDHC1_CARD_DET_N_PIO7_24 IOPCTL_MUX(2, 120, 1) /* PIO7_24 */
#define GPIO7_GPIO25_PIO7_25 IOPCTL_MUX(2, 121, 0) /* PIO7_25 */
#define LP_FLEXCOMM13_P5_PIO7_25 IOPCTL_MUX(2, 121, 2) /* PIO7_25 */
#define LP_FLEXCOMM2_P6_PIO7_25 IOPCTL_MUX(2, 121, 3) /* PIO7_25 */
#define SDHC1_RESET_N_PIO7_25 IOPCTL_MUX(2, 121, 1) /* PIO7_25 */
#define CTIMER5_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER5_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER6_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE1_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE2_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER7_CAPTURE3_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define CTIMER_S_INP0_PIO8_0 IOPCTL_MUX(1, 0, 2) /* PIO8_0 */
#define GPIO8_GPIO0_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define JTAG_TCK_PIO8_0 IOPCTL_MUX(1, 0, 5) /* PIO8_0 */
#define LP_FLEXCOMM17_P5_PIO8_0 IOPCTL_MUX(1, 0, 1) /* PIO8_0 */
#define PINT1_PINT0_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT1_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT2_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define PINT1_PINT3_PIO8_0 IOPCTL_MUX(1, 0, 0) /* PIO8_0 */
#define SWD_CLK_PIO8_0 IOPCTL_MUX(1, 0, 5) /* PIO8_0 */
#define CTIMER5_MATCH0_PIO8_1 IOPCTL_MUX(1, 1, 2) /* PIO8_1 */
#define GPIO8_GPIO1_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define JTAG_TMS_PIO8_1 IOPCTL_MUX(1, 1, 5) /* PIO8_1 */
#define LP_FLEXCOMM17_P6_PIO8_1 IOPCTL_MUX(1, 1, 1) /* PIO8_1 */
#define PINT1_PINT0_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT1_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT2_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define PINT1_PINT3_PIO8_1 IOPCTL_MUX(1, 1, 0) /* PIO8_1 */
#define SWD_DIO_PIO8_1 IOPCTL_MUX(1, 1, 5) /* PIO8_1 */
#define CTIMER5_MATCH1_PIO8_2 IOPCTL_MUX(1, 2, 2) /* PIO8_2 */
#define GPIO8_GPIO2_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define JTAG_TDI_PIO8_2 IOPCTL_MUX(1, 2, 5) /* PIO8_2 */
#define LP_FLEXCOMM17_P2_PIO8_2 IOPCTL_MUX(1, 2, 1) /* PIO8_2 */
#define PINT1_PINT0_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT1_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT2_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define PINT1_PINT3_PIO8_2 IOPCTL_MUX(1, 2, 0) /* PIO8_2 */
#define CTIMER5_CAPTURE0_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER5_CAPTURE1_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
#define CTIMER5_CAPTURE2_PIO8_3 IOPCTL_MUX(1, 3, 2) /* PIO8_3 */
